app/views/users/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
<p id="notice"> <%= notice %> </p>
<h2>Hi, <%= @user.name %></h2> <!--  undefined method `name' for nil:NilClass, 需要在 UsersController 中的 show 方法增加 @user = User.find(params[:id]), 来查找 user  -->